
{
    "NavLinks-About":"About",
    "NavLinks-Work":"Work",
    "NavLinks-Contact":"Contact",
    "NavLinks-Translator-English":"ENGLISH",
    "NavLinks-Translator-French":"FRENCH",
    
    "IT engineer student": "IT engineer student",
    
    "hero-head-1st-part": "Hi, I'm ",
    "hero-head-2nd-part": "Pierre Latorse",
    "hero-subtext-1st-part": "I love developing video games,",
    "hero-subtext-2nd-part": "VR solutions, and web applications",
    
    "overview": "Overview.",
    "about": "I am a French student in computer science at CESI Bordeaux, and a skilled video game developer with experience in 2 of the most used engines : Unity and Unreal Engine 5. I am also a huge fan of programming languages such as C, C#, C++, as well as creating websites like this one with the help of many frameworks. I am a quick learner and often work on my missions by team to create efficient, scalable, and user-friendly games, as well as making solutions that solve real-world problems. Let's work together to create innovative and memorable solutions for users !",
    "resume-btn": "See my Resume here !",
    
    "Services-GameDev":"Game Developer",
    "Services-VRGameDev":"VR Game Developer",
    "Services-WebDev":"Web Developer",
    "Services-SoftwareDev":"Software Developer",
    
    "hobbies-title": "My hobbies.",
    "hobbies-content": "Video games, sports, and music are the pillars of my passions, each bringing a unique and enriching experience to my life. Collectively, these passions enrich my life in countless ways. They bring me joy, teach me valuable lessons, and provide a means of connection with others who share similar interests. They challenge me, inspire me, and allow me to discover new facets of myself. Through video games, sports, and music, I find a sense of purpose, fulfillment, and a never-ending source of excitement.",
    "Hobbies-VideoGames-title":"Video Games",
    "Hobbies-VideoGames-content":"Love playing video games as well as creating them.",
    "Hobbies-Music-title":"Music",
    "Hobbies-Music-content":"I have been learning how to play bass by myself for 5 years.",
    "Hobbies-Sports-title":"Sports",
    "Hobbies-Sports-content":"I practiced Fencing and Rifle Shooting for 6 years each at a national level. Since 2020, I practice boulder climbing.",
    
    "Experiences-CurvatureGames-title":"VR Game Developer Intern",
    "Experiences-CurvatureGames-company":"Curvature Games, Germany",
    "Experiences-CurvatureGames-date":"Sept 2023 - Feb 2024",
    "Experiences-CurvatureGames-1st-point":"Developing and maintaining a VR game project on Unity.",
    "Experiences-CurvatureGames-2nd-point":"Collaborating with a german cross-functional team including designers, product managers, and other developers to create high-quality products.",
    "Experiences-CurvatureGames-3rd-point":"Implementing main gameplay mechanics, prototyping and optimizing for target devices via Profiler.",
    "Experiences-CurvatureGames-4th-point":"Practice english and participate in all the playtests for the project.",
    "Experiences-Scissors-title":"Game Developer Intern",
    "Experiences-Scissors-company":"Scissors In The Plug, France",
    "Experiences-Scissors-date":"Jan 2023 - April 2023",
    "Experiences-Scissors-1st-point":"Developing and maintaining 2D, 3D as well as VR video games on multiple engines such as Unity and Unreal Engine 5.1.",
    "Experiences-Scissors-2nd-point":"Collaborating with cross-functional teams including designers, product managers, and other developers to create high-quality products.",
    "Experiences-Scissors-3rd-point":"Implementing main gameplay mechanics, and optimizing for target devices via Profiler.",
    "Experiences-Scissors-4th-point":"Participating in preproduction, production and postproduction.",
    "Experiences-BM-title":"Web Developer intern",
    "Experiences-BM-company":"Bordeaux Métropole, France",
    "Experiences-BM-date":"April 2022 - July 2022",
    "Experiences-BM-1st-point":"Helping in the development of a web application to simplify the integration and supervision of different applications within the metropolis.",
    "Experiences-BM-2nd-point":"Developing and maintaining a web application using Vue.js (Vue3) and other related technologies such as Django framework.",
    "Experiences-BM-3rd-point":"Programming with Python, HTML, CSS, Javascript languages.",
    "Experiences-BM-4th-point":"Collaborating with integration and supervision service teams.",
    "Experiences-BM-5th-point":"Implementing responsive design and ensuring the integrity of the recovered data.",
    "Experiences-BM-6th-point":"Participating in code reviews and providing constructive feedback to other developers.",
    "Experiences-Kalivitis-title":"Production assistant",
    "Experiences-Kalivitis-company":"SARL Kalivitis, France",
    "Experiences-Kalivitis-date":"July 2021 - Aug 2021",
    "Experiences-Kalivitis-1st-point":"Helping the wine company to manage all the events such as bottling, container filling, etc.",
    "Experiences-Kalivitis-2nd-point":"Preparing the orders.",
    "Experiences-Kalivitis-3rd-point":"Making trips by car to supervise some orders prepartion at our partners winery.",
    "Experiences-Kalivitis-4th-point":"Proposing new ideas to help the company in the future by working on their organization for example.",
    
    "What others say": "What others say",
    "Testimonials.": "Testimonials.",
    "Testimonials-CurvatureGames-content":"Pierre demonstrated exceptional skills, including game design and programming in the Unity engine, as well as project management and sprint planning with agile methodologies. His commitment and engagement consistently surpassed expectations.",
    "Testimonials-CurvatureGames-designation":"Managing Director & Co-founder",
    "Testimonials-CurvatureGames-company":"Curvature Games",
    "Testimonials-Scissors-content":"Pierre developed a talent for understanding what a game is all about. Either technically, humanly, financially or from a game design point of view. I have complete confidence in him for the position of video game developer or the position of IT engineer.",
    "Testimonials-Scissors-designation":"CTO",
    "Testimonials-Scissors-company":"Scissors In The Plug",
    "Testimonials-BM-content":"Serious, punctual and endowed with a team spirit facilitating his integration within the team, these qualities testify to his voluntary attitude and allow him to adopt new working methods with ease.",
    "Testimonials-BM-designation":"Integration Engineer",
    "Testimonials-BM-company":"Bordeaux Métropole",

    "Projects-Header-Title": "My work",
    "Projects-Header-Subtitle": "Projects.",
    "Projects-Header-Content":"Following projects showcases my skills and experience through real-world examples of my work. Each project is briefly described with links to code repositories and live demos in it. It reflects my ability to solve complex problems, work with different technologies, and manage projects effectively.",
    "Projects-Daimon-description":"2D narrative RPG video game project, strongly inspired by Undertale by Toby Fox, in production on Unity.",
    "Projects-VirtualLab-description":"A Virtual Reality game about laboratory experiences made for meta quest 2 and 3 on Unity. In this game, you will have to complete quests following the narrator instructions.",
    "Projects-Portfolio-description":"A website working as a portfolio to show my skills in web development as well as video game development with some 3D models integration with Three JS.",
    "Projects-ArchiViz-description":"Realistic architectural visualization project in virtual reality developed on Unreal Engine 5.1 for Meta Quest 2 during my internship at Scissors In The Plug.",
    "Projects-Will-description":"Horrific narrative puzzle game project in collaboration with a narrative designer, developed on Unity. In this game the character will realize little by little he is controlled by the player and will try to break the 4th wall.",
    "Projects-LaGrosseBertha-description":"2D multiplayer video game based on a tower defense gameplay where the main goal is to destroy the opponent's cannon 'Grosse Bertha' with our own while gaining part of the battlefield little by little.",
    "Projects-ProtechSecurite-description":"3D object demonstrator for the bulletproof carpentry company ProTech Securité which wanted to be able to visualize their new product and present it on a tablet to future customers.",
    "Projects-Platformer-description":"2D platformer video game in which gameplay mechanics are based on those of a platformer where the player embodies a knight who must reach the end of the level like a game of the Mario Bros license.",
    "Projects-FindUXv2-description":"Monitoring web application based on the django framework using Python language, and on VueJS framework using HTML, CSS & Javascript. The goal of this project was to help the integration and supervision department on their mission by delivering a realtime monitoring app & automate applications integration in the metropolis of Bordeaux based on GitLab pipelines.",
    "Projects-Nternship-description":"Internship research application, such as job search websites, based on web languages (HTML, CSS, PHP, javascript) and a link to a database via the use of phpMyAdmin. The goal of this project was to help my school providing a website for students struggling to find an internship. This website contains some offers for students and they can apply to them depending on its location and what he is searching.",
    "Projects-InventoryManager-description":"Store inventory manager project based on SQL queries made with C++ on a MySQL database. The goal of this project was to provide an application to a store in order to visualise product quantities and many other aspects related to their inventory.",
    "Projects-Test-Btn":"Click here to test!",
    
    "Contact.": "Contact.",
    "Networks": "Networks",
    "Get in touch": "Get in touch",
    "Your Name": "Your Name",
    "What's your good name?": "What's your good name?",
    "Your email": "Your email",
    "What's your email?": "What's your email?",
    "Your message": "Your message",
    "What you want to say?": "What you want to say?",
    "Send-Btn-Text": "Send",
    "Send-Btn-Text-Sending": "Sending..."
}