
{
    "NavLinks-About":"À propos",
    "NavLinks-Work":"Travail",
    "NavLinks-Contact":"Contact",
    "NavLinks-Translator-English":"ANGLAIS",
    "NavLinks-Translator-French":"FRANÇAIS",
    
    "IT engineer student": "Étudiant Ingénieur Informatique",
    
    "hero-head-1st-part": "Salut, je m'appelle ",
    "hero-head-2nd-part": "Pierre Latorse",
    "hero-subtext-1st-part": "J'adore créer des jeux vidéo,",
    "hero-subtext-2nd-part": "solutions VR, et applications web",
    
    "overview": "Aperçu.",
    "about": "Je suis un étudiant français en informatique à CESI Bordeaux, et un développeur de jeux vidéo compétent avec de l'expérience dans 2 des moteurs les plus utilisés : Unity et Unreal Engine 5. Je suis aussi un grand fan des langages de programmation tels que C, C#, C++, ainsi que de la création de sites web comme celui-ci avec l'aide de nombreux frameworks. Je suis un apprenant rapide et je travaille souvent en équipe sur mes missions pour créer des jeux efficaces, évolutifs et conviviaux, ainsi que pour créer des solutions qui résolvent des problèmes réels. Travaillons ensemble pour créer des solutions innovantes et mémorables pour les utilisateurs !",
    "resume-btn": "Voir mon CV ici !",
    
    "Services-GameDev":"Game Developer",
    "Services-VRGameDev":"VR Game Developer",
    "Services-WebDev":"Web Developer",
    "Services-SoftwareDev":"Software Developer",
    
    "hobbies-title": "Mes hobbies.",
    "hobbies-content": "Les jeux vidéo, le sport et la musique sont les piliers de mes passions, chacun apportant une expérience unique et enrichissante à ma vie. Collectivement, ces passions enrichissent ma vie de nombreuses façons. Elles me procurent de la joie, m'apprennent des leçons précieuses et me permettent de me connecter avec d'autres personnes qui partagent des intérêts similaires. Elles me mettent au défi, m'inspirent et me permettent de découvrir de nouvelles facettes de moi-même. À travers les jeux vidéo, le sport et la musique, je trouve un sens à ma vie, un accomplissement et une source inépuisable d'excitation.",
    "Hobbies-VideoGames-title":"Jeux vidéo",
    "Hobbies-VideoGames-content":"J'adore jouer aux jeux vidéo tout autant que les créer.",
    "Hobbies-Music-title":"Musique",
    "Hobbies-Music-content":"J'apprends à jouer de la basse par moi-même depuis 5 ans.",
    "Hobbies-Sports-title":"Sports",
    "Hobbies-Sports-content":"J'ai pratiqué l'escrime et le tir à la carabine au niveau national pendant 6 ans chacun. Depuis 2020, je pratique l'escalade en bloc.",
    
    "Experiences-CurvatureGames-title":"Stagiaire développeur de jeux en réalité virtuelle.",
    "Experiences-CurvatureGames-company":"Curvature Games, Allemagne",
    "Experiences-CurvatureGames-date":"Sept 2023 - Fév 2024",
    "Experiences-CurvatureGames-1st-point":"Développer et maintenir un projet de jeu VR sur Unity.",
    "Experiences-CurvatureGames-2nd-point":"Collaborer avec une équipe allemande multi-fonctionnelle incluant des designers, product managers, et autres développeurs afin de créer des produits de haute qualité.",
    "Experiences-CurvatureGames-3rd-point":"Implémenter les mécaniques de gameplay principales, prototyper et optimiser pour adapter la solution au périphérique cible via l'utilisation du Profiler.",
    "Experiences-CurvatureGames-4th-point":"Entraîner mon anglais et participer à tous les playtests du projet.",
    "Experiences-Scissors-title":"Stagiaire développeur de jeux vidéo.",
    "Experiences-Scissors-company":"Scissors In The Plug, France",
    "Experiences-Scissors-date":"Jan 2023 - Avr 2023",
    "Experiences-Scissors-1st-point":"Développer et maintenir des jeux vidéo 2D, 3D ainsi que des solutions VR sur de multiples moteurs tels que Unity et Unreal Engine 5.1.",
    "Experiences-Scissors-2nd-point":"Collaborer avec une équipe multi-fonctionnelle incluant des designers, product managers, et autres développeurs afin de créer des produits de haute qualité.",
    "Experiences-Scissors-3rd-point":"Implémenter les mécaniques de gameplay principales, et optimiser la solution pour les périphériques cible via l'utilisation du Profiler.",
    "Experiences-Scissors-4th-point":"Participer dans la phase de pré-production, production et post-production.",
    "Experiences-BM-title":"Stagiaire développeur web",
    "Experiences-BM-company":"Bordeaux Métropole, France",
    "Experiences-BM-date":"Avr 2022 - Juil 2022",
    "Experiences-BM-1st-point":"Aider dans le dévelopemment d'une application web afin de simplifier l'intégration et la supervision de différentes applications au sein de la Métropole.",
    "Experiences-BM-2nd-point":"Développer et maintenir une application web utilisant Vue.js (Vue3) et d'autres technologies liées tels que le framework Django.",
    "Experiences-BM-3rd-point":"Programmer en language Python, HTML, CSS, Javascript.",
    "Experiences-BM-4th-point":"Collaborer avec les équipes du service intégration et supervision.",
    "Experiences-BM-5th-point":"Implémenter des designs responsive et assurer l'intégrité des données récupérées.",
    "Experiences-BM-6th-point":"Participer aux revues de code et promouvoir des retours constructifs aux autres développeurs.",
    "Experiences-Kalivitis-title":"Assistant de production",
    "Experiences-Kalivitis-company":"SARL Kalivitis, France",
    "Experiences-Kalivitis-date":"Juil 2021 - Août 2021",
    "Experiences-Kalivitis-1st-point":"Aider l'entreprise de négociants en vin à manager/préparer leurs évènements tels que la mise en bouteille, le remplissage de conteneurs, etc.",
    "Experiences-Kalivitis-2nd-point":"Préparer les commandes.",
    "Experiences-Kalivitis-3rd-point":"Faire des trajets en voiture pour superviser la préparation de certaines commandes chez les vignobles partenaires.",
    "Experiences-Kalivitis-4th-point":"Proposer de nouvelles idées pour aider l'entreprise dans le futur en travaillant sur leur capacité d'organisation par exemples.",
    
    "What others say": "Ce que les gens disent de moi",
    "Testimonials.": "Témoignages.",
    "Testimonials-CurvatureGames-content":"Pierre a su démontrer des compétences exceptionnelles, que ce soit en game design et en programmation en travaillant sur le moteur Unity, ainsi qu'en gestion de projet et en plannification de sprint utilisant les méthodologies agile. Son dévouement et son engagement ont constamment surpassé mes attentes.",
    "Testimonials-CurvatureGames-designation":"Managing Director & Co-fondateur",
    "Testimonials-CurvatureGames-company":"Curvature Games",
    "Testimonials-Scissors-content":"Pierre a développé un talent pour comprendre de quoi est fait un jeu dans son ensemble. Autant techniquement, humainement, financiairement, que du point de vue du game design. J'ai une complète confiance en lui afin d'assurer un poste de développeur jeux vidéo ou bien même celle d'ingénieur informatique.",
    "Testimonials-Scissors-designation":"CTO",
    "Testimonials-Scissors-company":"Scissors In The Plug",
    "Testimonials-BM-content":"Sérieux, ponctuel et doté d'un esprit d'équipe facilitant son intégration au sein de l'équipe, ces qualités témoignent de son attitude et lui permettent d'adopter de nouvelles méthodes de travail avec aisance.",
    "Testimonials-BM-designation":"Ingénieur intégrateur",
    "Testimonials-BM-company":"Bordeaux Métropole",

    "Projects-Header-Title": "Mes travaux",
    "Projects-Header-Subtitle": "Projets.",
    "Projects-Header-Content":"Les projets suivants illustrent mes compétences et mon expérience à travers des exemples concrets de mon travail. Chaque projet est brièvement décrit avec des liens vers des dépôts de code et des démonstrations en direct. Cela reflète ma capacité à résoudre des problèmes complexes, à travailler avec différentes technologies et à gérer efficacement des projets.",
    "Projects-Daimon-description":"Un projet de jeux vidéo au style RPG narratif aventure en 2D, fortement inspiré d'Undertale par Toby Fox, en cours de production sur Unity.",
    "Projects-VirtualLab-description":"Un jeux vidéo en réalité virtuelle qui traite d'expériences réalisées en laboratoire, pour meta quest 2 et 3 sur Unity. Dans ce jeu, vous allez devoir compléter des quêtes tout en suivant les instructions du narrateur.",
    "Projects-Portfolio-description":"Un site web servant de portfolio afin de démontrer mes compétences en développement web, ainsi que dans le dévelopemment de jeux vidéo avec des intégrations 3D à l'aide du framework Three JS.",
    "Projects-ArchiViz-description":"Un projet de visite virtuelle architecturale réalistique en réalité virtuelle développé sur Unreal Engine 5.1 pour Meta Quest 2 lors de mon stage chez Scissors In The Plug.",
    "Projects-Will-description":"Un jeux vidéo au style horreur, narratif et puzzle game en collaboration avec une narrative designer, développé sur Unity. Dans ce jeu, le personnage principal va réaliser petit à petit qu'il est contrôlé par le joueur et va essayer de casser le 4ème mur.",
    "Projects-LaGrosseBertha-description":"Un jeux vidéo en 2D multijoueur basé sur un gameplay de tower defense où l'objectif principal est de détruire le canon adverse nommé 'Grosse Bertha' avec votre propre canon pendant que vous gagnez, petit à petit, du terrain sur le champ de bataille.",
    "Projects-ProtechSecurite-description":"Un projet démonstrateur de modélisation 3D servant à l'entreprise de menuiserie pare-balle ProTech Securité qui souhaitait avoir la possibilité de visualiser leurs nouveaux produits et les présenter sur une tablette à leurs futurs clients.",
    "Projects-Platformer-description":"Un jeux vidéo 2D au style platformer dans lequel les mécaniques de gameplay sont basés sur celles d'un platformer typique où le joueur incarne un chevalier dont le but est d'atteindre la fin du niveau tels que dans les jeux vidéo de la licence Mario Bros.",
    "Projects-FindUXv2-description":"Une application web de supervision basé sur le framework Django, lui-même se servant du langage Python, ainsi que sur le framework VueJS qui utilise les langages HTML, CSS & Javascript. Le but de ce projet était d'aider le service intégration et supervision dans leurs missions en proposant une application web de supervision en temps réel & automatiser l'intégration d'applications dans la métropole de Bordeaux tout en se basant sur le système de GitLab Pipelines.",
    "Projects-Nternship-description":"Une application web de recherche de stage, dans le même style que la majorité des sites de recherche d'emploi, basé sur les langages web typiques (HTML, CSS, PHP, javascript) et lié à une base de données via l'utilisation de phpMyAdmin. Le but de ce projet était d'aider mon école en proposant un site web pour les étudiants en galère dans leurs recherches de stage. Ce site web contient alors quelques offres de stage pour les étudiants auxquelles ils peuvent postuler en fonction de leur localisation et du stage recherché.",
    "Projects-InventoryManager-description":"Un gestionnaire d'inventaire de commerce basé sur des requêtes SQL faites en C++ sur une base de données MySQL. Le but de ce projet était de proposer une application à un commerce quelconque afin de visualiser les quantités de certains produits en stock ainsi que plein d'autres aspects liés à leur inventaire.",
    "Projects-Test-Btn":"Testez le ici!",


    
    "Contact.": "Contact.",
    "Networks": "Réseaux sociaux",
    "Get in touch": "Contactez-moi",
    "Your Name": "Votre nom",
    "What's your good name?": "Quel est votre nom ?",
    "Your email": "Votre email",
    "What's your email?": "Quelle est votre adresse e-mail ?",
    "Your message": "Votre message",
    "What you want to say?": "Que souhaitez-vous dire ?",
    "Send-Btn-Text": "Envoyer",
    "Send-Btn-Text-Sending": "Envoi..."
}